app/views/contents/index.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        %td
          =User.find(content.user.id).id
          &nbsp;
          =User.find(content.user.id).email