app/views/contents/show.html.haml

  %b User:
  = User.find(@content.user.id).email
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]