app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents"

  def create
    @content = Content.new
    @content.title = content_params[:title]
    if content_params[:user].is_a?(Integer)
      @content.user = User.find(content_params[:user]).id
    elsif content_params[:user].is_a?(String)
      @content.user = User.find_by_email(content_params[:user]).id
    elsif content_params[:user_id]
      @content.user = User.find(content_params[:user_id])
    end

    respond_to do |format|
      if @content.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "contents" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Simple Content 1"], ["user_id", 1], ["created_at", "2019-07-18 18:26:27.495977"], ["updated_at", "2019-07-18 18:26:27.495977"]]

  def update
    respond_to do |format|
      if @content.update(content_params)
---
UPDATE "contents" SET "title" = ?, "updated_at" = ? WHERE "contents"."id" = ?  [["title", "manual title oof"], ["updated_at", "2019-07-18 18:30:14.966893"], ["id", 1]]

    def set_content
      @content = Content.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]